{
  "template": "one-col-it",
  "general": {
    "name": "Elia Lotti",
    "jobtitle": "Fullstack Developer",
    "tel": "+393408424351",
    "email": "elialotti.dev@gmail.com",
    "location": "Certaldo (FI)",
    "website": "elialotti.com",
    "linkedin": "elia-lotti-dev",
    "github": "kaosdev"
  },
  "experience": [
    {
      "title": "Fullstack Developer",
      "company": "Flowy",
      "start": "sep 2024",
      "end": "ongoing",
      "location": "",
      "descriptions": [
        "Sviluppata e gestita una dashboard intuitiva per aziende di trasporto, migliorando il processo decisionale attraverso la visualizzazione dei dati sui passeggeri con Angular e Tailwind CSS per il frontend ed Express.js integrato con MongoDB per il backend.",
        "Create visualizzazioni interattive dei dati, come tabelle, grafici e viste personalizzate, per fornire insights sul flusso dei passeggeri, l'utilizzo delle carrozze e le tendenze di ingresso/uscita.",
        "Collaborato con team interfunzionali per integrare i dati dei sensori nella dashboard."
      ]
    },
    {
      "title": "Backend Developer",
      "company": "ProfessionAI",
      "start": "aug 2024",
      "end": "ongoing",
      "location": "",
      "descriptions": [
        "Creata una piattaforma web per permettere ai tutor di gestire le consegne dei progetti e fornire feedback dettagliati agli studenti, usato python, nicegui e DynamoDB.",
        "Implementato un algoritmo di assegnazione che ha ottimizzato la distribuzione delle consegne ai tutor, riducendo i tempi di correzione.",
        "Progettata e implementata una dashboard per studenti con backend FastAPI e archiviazione dati su MongoDB per monitorare i progressi del master, inclusi lo stato dei corsi e dei progetti."
      ]
    },
    {
      "title": "Software Developer",
      "company": "autonomo",
      "start": "feb 2022",
      "end": "attuale",
      "location": "",
      "descriptions": [
        "Progettato e implementato una web app per il controllo remoto di fresatrici utilizzando Angular, NestJS e PostgreSQL.",
        "Sviluppata una web app per il calcolo dei prezzi delle case con NestJS, Angular e PostgreSQL, messa in produzione su Google Cloud con pratiche CI/CD.",
        "Creato il software di un dispositivo medico analitico utilizzando Python, PyQt5 per l'interfaccia utente e OpenCV per l'elaborazione delle immagini.",
        "Fornito supporto e mentoring per un progetto sviluppato in React ed Express.",
        "Sviluppata una piattaforma per la fatturazione elettronica."
      ]
    },
    {
      "title": "Frontend Developer \\& ML Engineer",
      "company": "Hermes Trade",
      "start": "lug 2018",
      "end": "mar 2023",
      "location": "Firenze",
      "descriptions": [
        "Seguito un team di 4 data scientist in un contesto di consulenza.",
        "Implementato e distribuito algoritmi di Machine Learning utilizzando Angular, React, FastAPI, Celery, Redis, Docker e tecnologie AWS.",
        "Sviluppato un sistema per addestrare anomaly detectors su dati temporali a breve termine con Python e TensorFlow.",
        "Creata una libreria Python per la manipolazione di dataset COCO.",
        "Progettato un sistema low-code per la creazione di erp custom, utilizzando Angular e Python."
      ]
    }
  ],
  "skills": {
    "Frontend": ["Angular", "ReactJS", "Typescript", "RxJS"],
    "Backend": ["Python", "FastAPI", "Express", "NestJS"],
    "Database": ["PostgreSQL", "MongoDB", "DynamoDB"],
    "Machine Learning": ["Tensorflow", "pandas", "scikit-learn"],
    "DevOps": ["Docker", "AWS", "Google Cloud"]
  },
  "languages": {
    "Italiano": 5,
    "Inglese": 4
  },
  "certifications": [],
  "education": [
    {
      "title": "Tensorflow Developer Certificate",
      "academy": "Tensorflow",
      "date": "09/2021 -- 09/2024",
      "link": "https://www.credential.net/255b9c9e-2984-4c80-9525-69781c4f5d73"
    },
    {
      "title": "Diploma in Informatica",
      "academy": "IIS G.Ferraris - F. Brunelleschi",
      "date": "09/2020"
    }
  ]
}
